Autodesk.Revit.DB.TessellatedShapeBuilder
A class that permits structured building of geometry or
a mesh from a collection of connected faces.
Contains all closed face sets and custom precisions.
Remarks:
Creates a geometry populated with a shell or a connected solid (a
solid may have inner voids) from the sets of connected faces.
All faces are planar and have polyline boundaries, defined
as sequences of 3d coordinates.
Faces are added to the builder as a part of face sets,
representing faces which share edges
(e.g., outer 'surface' of a solid or inner 'surface'
of solid voids). Order of faces in sets is irrelevant. Faces can only
be added to the build while a face set is "open" (use
Autodesk.Revit.DB.TessellatedShapeBuilder.OpenConnectedFaceSet(System.Boolean) to open a face set).
Before attempting to build Revit geometry from the builder
the current face set should be closed
(Autodesk.Revit.DB.TessellatedShapeBuilder.CloseConnectedFaceSet).
The builder allows for the possibility of multiple face
sets - in such cases the first set should represent the
outer 'surface' of a body and all following sets
represent interior voids.
The builder tries to create a geometry valid in Revit despite
inconsistencies or omissions in the input data.
Since:
2015